### Final Project Submission

* Student name: Isiah Cruz
* Student pace: Part-Time
* Scheduled project review date/time: April 27, 2020
* Instructor name: Eli Thomas
* Blog post URL:

# Data Cleaning

In [59]:
import pandas as pd #importing data analysis library under the alias pd
import numpy as np #importing scientific computation library under the alias np

In [60]:
df1 = pd.read_csv('./zippeddata/imdb.title.ratings.csv.gz') #importing the IMDB ratings dataset
df2 = pd.read_csv('./zippeddata/imdb.title.basics.csv.gz') #importing the IMDB title basics dataset
df3 = pd.read_csv('./zippedData/rt.movie_info.tsv', sep="\t") #importing the RT movie info dataset

## Dataset #1: IMDB Ratings

In [61]:
df1.head() #taking a look at the first 5 cells in the dataset

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [62]:
df1.info() #looking at the datatypes in this dataset, it's clear there is some deviation between columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

Next, it makes sense that the datatype of the tconst column is an object since the unique identifiers for our movies contain letters,

However, in order to really make some headway with our data, it's probably best that we make the remaining columns ('averagerating' and 'numvotes') the same datatype,

Therefore, we will try and convert the 'averagerating' column into an int64 datatype since these are generally easier to work with than float64.

In [63]:
df1['averagerating'] = df1.averagerating.map(lambda x: x*10)

#running a lambda function that converts all of our ratings from being out of 10 to being out of 100
#for example, an average rating of 83 tells us the same as an average rating of 8.3
#except the former allows us to align the datatypes of the columns we have selected

In [64]:
df1.head() #looking to see if the function worked (it did!)

       tconst  averagerating  numvotes
0  tt10356526           83.0        31
1  tt10384606           89.0       559
2   tt1042974           64.0        20
3   tt1043726           42.0     50352
4   tt1060240           65.0        21

In [65]:
df1.info() #checking to see if the datatypes have changed

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

Alas, the datatypes have not changed so it's time to try something else.

In [66]:
df1['averagerating'] = df1.averagerating.astype(int) #converting the datatype to an int

In [67]:
df1.head() #taking a look at the first 5 cells in the dataset

       tconst  averagerating  numvotes
0  tt10356526             83        31
1  tt10384606             89       559
2   tt1042974             64        20
3   tt1043726             42     50352
4   tt1060240             65        21

In [68]:
df1.info() #checking to see if the datatype of the last 2 columns now match

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null int64
numvotes         73856 non-null int64
dtypes: int64(2), object(1)
memory usage: 1.7+ MB

In [69]:
df1.to_csv('imdb.ratings.cleaned.csv') #saving the cleaned dataset at a csv

Success! The 'numvotes' column has been converted to become an int64 datatype.

## Dataset #2: IMDB Basics

In [70]:
df2.head() #taking a look at the first 5 cells in the IMDB ratings dataset

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [71]:
df2.info() #looking at the datatypes in this dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [72]:
df2.isna().sum() #checking for NaN values and summing them to see how much cleaning we have to do

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [73]:
df2['runtime_minutes'].head() #looking at what we are working with

0    175.0
1    114.0
2    122.0
3      NaN
4     80.0
Name: runtime_minutes, dtype: float64

It looks like some movies do not have data in the runtime column, so now we have to devise a way to either drop or replace these NaN values.

In [74]:
df2['runtime_minutes'].describe() #running the describe function which gives us the mean of the column (86.187)

count    114405.000000
mean         86.187247
std         166.360590
min           1.000000
25%          70.000000
50%          87.000000
75%          99.000000
max       51420.000000
Name: runtime_minutes, dtype: float64

In [75]:
df2['runtime_minutes'] = df2['runtime_minutes'].fillna(value=df2['runtime_minutes'].median, inplace=False)

#replacing the NaN values with the median of the runtime column this way we do not mess with the data too much

In [76]:
df2.isna().sum() #checking to see if the amount of NaN values has changed

tconst                0
primary_title         0
original_title       21
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

Great, so we no longer have NaN values in the 'runtime_minutes' column, but we still have some elsewhere.

In looking at the 'original_title' column, there does not seem to be a significant difference with the 'primary_title' column.

Thus, we should be OK to drop the 'original_title' column altogether.

In [77]:
df2 = df2.drop(columns=['original_title']) #dropping the column

In [78]:
df2.isna().sum() #checking to see if the amount of NaN values has changed

tconst                0
primary_title         0
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

In [79]:
df2['genres'] = df2['genres'].fillna(method='ffill') #filling the NaN values with the values from the preceding row

In [80]:
df2.isna().sum() #checking to see if the amount of NaN values has changed

tconst             0
primary_title      0
start_year         0
runtime_minutes    0
genres             0
dtype: int64

In [81]:
df2.head() #taking a look at the first 5 cells in the dataset

,tconst,primary_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,2013,175,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,2019,114,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0069204,Sabse Bada Sukh,2018,<bound method Series.median of 0 175.0...,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,2017,80,"Comedy,Drama,Fantasy"

In [82]:
df2.to_csv('imdb.title.basics.cleaned.csv') #saving the cleaned dataset at a csv

Our dataset is now cleaned since there are no more NaN values!

Now let's take a look at our final dataset.

## Dataset #3: Rotten Tomatoes Movie Info

In [83]:
df3.head() #taking a look at the first 5 cells in the dataset

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [84]:
df3 = df3.drop(columns=['synopsis']) #dropping the 'synopsis' column since we will not be needing it

In [85]:
df3 = df3.drop(columns=['id']) #dropping the 'id' column since we will not be needing it

In [86]:
df3 = df3.drop(columns=['dvd_date']) #dropping the 'dvd_date' column since we will not be needing it

In [87]:
df3 = df3.drop(columns=['studio']) #dropping the 'studio' column since we will not be needing it

In [88]:
df3.info() #checking to see which data types we have

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 8 columns):
rating          1557 non-null object
genre           1552 non-null object
director        1361 non-null object
writer          1111 non-null object
theater_date    1201 non-null object
currency        340 non-null object
box_office      340 non-null object
runtime         1530 non-null object
dtypes: object(8)
memory usage: 97.6+ KB

As we can see, our 'theater_date' column is structured as an object deta type and is written out in long form (i.e. Aug 27, 1997), however, we should only need the year of release (not the month and the day) so let's try to parse out the data that we need using a split function.

In [89]:
new = df3["theater_date"].str.split(",", n =1, expand = True)
new.head()

#creating a new dataframe called 'new' where we separate the values in each row by the commma

        0      1
0   Oct 9   1971
1  Aug 17   2012
2  Sep 13   1996
3   Dec 9   1994
4     NaN    NaN

In [90]:
df3['theater_date'] = new[1]
df3.head()

#apply only the values that we want (i.e. 1971) back to the original 'theater_date' column

,rating,genre,director,writer,theater_date,currency,box_office,runtime
0,R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,1971,NaN,NaN,104 minutes
1,R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,2012,$,"600,000",108 minutes
2,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,1996,NaN,NaN,116 minutes
3,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,1994,NaN,NaN,128 minutes
4,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,200 minutes

In [91]:
df3.info() #checking to see which data types we have

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 8 columns):
rating          1557 non-null object
genre           1552 non-null object
director        1361 non-null object
writer          1111 non-null object
theater_date    1201 non-null object
currency        340 non-null object
box_office      340 non-null object
runtime         1530 non-null object
dtypes: object(8)
memory usage: 97.6+ KB

In [92]:
df3.dropna(subset=['theater_date'], how='all', inplace=True)
df3['theater_date'].isna().sum()

#removing the rows with NaN values in the 'theater_date' column

0

In [93]:
df3['theater_date'] = df3['theater_date'].astype(int)

#converting the 'theater_date' column to an int datatype

In [94]:
df3.info() #checking to see if the change was made successfully

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1201 entries, 0 to 1559
Data columns (total 8 columns):
rating          1201 non-null object
genre           1201 non-null object
director        1083 non-null object
writer          938 non-null object
theater_date    1201 non-null int64
currency        334 non-null object
box_office      334 non-null object
runtime         1194 non-null object
dtypes: int64(1), object(7)
memory usage: 84.4+ KB

In [95]:
df3.isna().sum() #summing the remaining NaN values in our dataset

rating            0
genre             0
director        118
writer          263
theater_date      0
currency        867
box_office      867
runtime           7
dtype: int64

In [96]:
df3.dropna(subset=['box_office'], how='all', inplace=True)
df3['box_office'].isna().sum()

#removing the rows with NaN values in the 'box_office' column

0

In [97]:
df3['box_office'].replace(',','', regex=True, inplace=True)
df3.head()

#removing the commas from the 'box_office' column that way we can use it as an integer

,rating,genre,director,writer,theater_date,currency,box_office,runtime
1,R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,2012,$,600000,108 minutes
6,PG-13,Comedy,Jake Kasdan,Mike White,2002,$,41032915,82 minutes
7,R,Drama,Ray Lawrence,Raymond Carver|Beatrix Christian,2006,$,224114,123 minutes
8,R,Drama,Taylor Hackford,Mark Jacobson,2010,$,134904,117 minutes
15,R,Comedy|Drama|Mystery and Suspense,George Hickenlooper,Norman Snider,2010,$,1039869,108 minutes

In [98]:
df3['box_office'] = df3['box_office'].astype(int)

#converting the 'box_office' column to an int datatype

In [99]:
df3.info() #checking to see if the change was made successfully

<class 'pandas.core.frame.DataFrame'>
Int64Index: 334 entries, 1 to 1555
Data columns (total 8 columns):
rating          334 non-null object
genre           334 non-null object
director        295 non-null object
writer          270 non-null object
theater_date    334 non-null int64
currency        334 non-null object
box_office      334 non-null int64
runtime         332 non-null object
dtypes: int64(2), object(6)
memory usage: 23.5+ KB

In [100]:
df3.isna().sum() #checking to see how many remaining NaN values we have

rating           0
genre            0
director        39
writer          64
theater_date     0
currency         0
box_office       0
runtime          2
dtype: int64

We have converted the 'theater_date' and 'box_office' columns to INT, which will allow us to manipulate the data some more in the Data Exploration stage (next up).

We have also dropped several columns that are not critical to our analysis and removed NaN values from columns that are critical to our analysis like 'box_office'.

Now, we can save our data and move on to Data Exploration!

In [101]:
df3.to_csv('rt.cleaned.csv') #saving the cleaned dataset at a csv